Question 3

In [1]:
import numpy as np
import pandas as pd

In [2]:
series1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
series2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
series3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [3]:
df=pd.concat([series1, series2, series3], axis=1)
df.head()

   0  1      2
0  4  2  23888
1  4  1  25378
2  4  3  18850
3  2  2  10067
4  2  3  16249

In [4]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            23888
1      4       1            25378
2      4       3            18850
3      2       2            10067
4      2       3            16249

In [5]:
bigcolumn=pd.concat([series1,series2,series3],axis=0)
bigcolumn=bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       4
1       4
2       4
3       2
4       2
..    ...
95  16820
96  20288
97  21839
98  16966
99  24624

[300 rows x 1 columns]

In [6]:
len(bigcolumn)

300

In [7]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        4
2        4
3        2
4        2
..     ...
295  16820
296  20288
297  21839
298  16966
299  24624

[300 rows x 1 columns]